package KimHeesu;
/*Java 과제

학생 성적 관리 프로그램을 구현하는 실습을 진행하고 그 결과를 2.3(금) 까지 제출

학생의 관리 정보는 다음과 같다.
	학생 = {학생, 이름, 성별, 점수={국어, 영어, 수학, 과학 }}
	
여러 학생의 정보를 입력받아 저장하고 저장한 학생 정보에 대한 조회, 점수 변경, 학생 정보 삭제등의 작업을 수행 훌 수 있어야 한다.
===========================================================================================================
[실행 예]
### 학생 성적 관리 프로그램 ###

1. 학생 정보 입력
2. 학생 정보 조회
3. 성적 변경
4. 학생 정보 삭제
5. 프로그램 종료
>>> 1
============================================================================================================
[프로그램 구현 조건]

1. 학생 정보를 저장하는 자료구조는 배열,ArrayList,LinkedList, 직접 구현 등 자유롭게 사용할 수 있다.
2. 실행 예에서 보이는 주 메뉴 이후의 세부 메뉴는 자유롭게 정하여 사용하고, 세부 메뉴의 사용이 끝나면 항상 주 메뉴로 돌아와야 한다.
3. 학생 정보 입력은 학번, 이름, 성별, 국어, 영어, 수학, 과학 점수를 모두 입력 받아 저장한다.
4. 학생 정보 조회는 학번을 이용한 개별 조회와 전체 학생 정보조회 두 가지 조회 방식을 제공한다.
5. 성적 변경은 학번을 입력 받아 해당 학생의 성적 정보를 변경할 수 있다.
6. 학생 정보 삭제는 학번을 입력 받아 해당 학생의 정보를 제거할 수 있다.
7. 사용자가 프로그램 종료를 선택하지 않는 한 프로그램은 게속 동작하여야 한다.
8. 잘못된 사용자 입력으로 부터 견고히 잘 동작하는 프로그램을 작성하여야 한다.
9. 그 외 프로그램 구현의 모든 사항은 개발자가 자유롭게 정하여 최대한 객체지향 답게 구현하도록 한다.
10. 본인 이름의 패키지를 만들고 해당 패키지 안에 모든 관련 클래스들을 포함하여 압축한 후 (hong_gildong.zip 내이름) 제출한다.


*/

public class project {

}
